
## Plan Result (prod)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 5 to add, 5 to change, 39 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.flexible_secret_standard_format[&#34;DATABASE&#34;]
  * azurerm_key_vault_secret.flexible_secret_standard_format[&#34;HOST&#34;]
  * azurerm_key_vault_secret.flexible_secret_standard_format[&#34;PASS&#34;]
  * azurerm_key_vault_secret.flexible_secret_standard_format[&#34;PORT&#34;]
  * azurerm_key_vault_secret.flexible_secret_standard_format[&#34;USER&#34;]
* Update
  * azurerm_key_vault_secret.flexible_secret[&#34;DATABASE&#34;]
  * azurerm_key_vault_secret.flexible_secret[&#34;HOST&#34;]
  * azurerm_key_vault_secret.flexible_secret[&#34;PASS&#34;]
  * azurerm_key_vault_secret.flexible_secret[&#34;PORT&#34;]
  * azurerm_key_vault_secret.flexible_secret[&#34;USER&#34;]
* Delete
  * azurerm_key_vault_secret.POSTGRES-PASS
  * azurerm_key_vault_secret.POSTGRES-USER
  * azurerm_key_vault_secret.POSTGRES_DATABASE
  * azurerm_key_vault_secret.POSTGRES_HOST
  * azurerm_key_vault_secret.POSTGRES_PORT
  * azurerm_key_vault_secret.staging_db_host
  * azurerm_key_vault_secret.staging_db_name
  * azurerm_key_vault_secret.staging_db_password
  * azurerm_key_vault_secret.staging_db_port
  * azurerm_key_vault_secret.staging_db_user
  * module.reform-blob-router-db.azurerm_postgresql_active_directory_administrator.admin
  * module.reform-blob-router-db.azurerm_resource_group.data-resourcegroup
  * module.reform-blob-router-db.azurerm_template_deployment.postgres-paas
  * module.reform-blob-router-db.null_resource.set-user-permissions[0]
  * module.reform-blob-router-db.null_resource.subnet_mappings[0]
  * module.reform-blob-router-db.null_resource.subnet_mappings[1]
  * module.reform-blob-router-db.null_resource.subnet_mappings[2]
  * module.reform-blob-router-db.null_resource.subnet_mappings[3]
  * module.reform-blob-router-db.null_resource.subnet_mappings[4]
  * module.reform-blob-router-db.null_resource.subnet_mappings[5]
  * module.reform-blob-router-db.null_resource.subnet_mappings[6]
  * module.reform-blob-router-db.null_resource.subnet_mappings[7]
  * module.reform-blob-router-db.null_resource.subnet_mappings[8]
  * module.reform-blob-router-db.null_resource.subnet_mappings[9]
  * module.reform-blob-router-db.random_string.password
  * module.reform-blob-router-staging-db.azurerm_postgresql_active_directory_administrator.admin
  * module.reform-blob-router-staging-db.azurerm_resource_group.data-resourcegroup
  * module.reform-blob-router-staging-db.azurerm_template_deployment.postgres-paas
  * module.reform-blob-router-staging-db.null_resource.subnet_mappings[0]
  * module.reform-blob-router-staging-db.null_resource.subnet_mappings[1]
  * module.reform-blob-router-staging-db.null_resource.subnet_mappings[2]
  * module.reform-blob-router-staging-db.null_resource.subnet_mappings[3]
  * module.reform-blob-router-staging-db.null_resource.subnet_mappings[4]
  * module.reform-blob-router-staging-db.null_resource.subnet_mappings[5]
  * module.reform-blob-router-staging-db.null_resource.subnet_mappings[6]
  * module.reform-blob-router-staging-db.null_resource.subnet_mappings[7]
  * module.reform-blob-router-staging-db.null_resource.subnet_mappings[8]
  * module.reform-blob-router-staging-db.null_resource.subnet_mappings[9]
  * module.reform-blob-router-staging-db.random_string.password


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.POSTGRES-PASS will be destroyed
  # (because azurerm_key_vault_secret.POSTGRES-PASS is not in configuration)
  - resource "azurerm_key_vault_secret" "POSTGRES-PASS" {
      - id                      = "https://reform-scan-prod.vault.azure.net/secrets/blob-router-POSTGRES-PASS/f2530be599f44cc4b4cb5bcb02953f45" -> null
      - key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/reform-scan-prod/providers/Microsoft.KeyVault/vaults/reform-scan-prod" -> null
      - name                    = "blob-router-POSTGRES-PASS" -> null
      - resource_id             = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/reform-scan-prod/providers/Microsoft.KeyVault/vaults/reform-scan-prod/secrets/blob-router-POSTGRES-PASS/versions/f2530be599f44cc4b4cb5bcb02953f45" -> null
      - resource_versionless_id = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/reform-scan-prod/providers/Microsoft.KeyVault/vaults/reform-scan-prod/secrets/blob-router-POSTGRES-PASS" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value) -> null
      - version                 = "f2530be599f44cc4b4cb5bcb02953f45" -> null
      - versionless_id          = "https://reform-scan-prod.vault.azure.net/secrets/blob-router-POSTGRES-PASS" -> null
    }

  # azurerm_key_vault_secret.POSTGRES-USER will be destroyed
  # (because azurerm_key_vault_secret.POSTGRES-USER is not in configuration)
  - resource "azurerm_key_vault_secret" "POSTGRES-USER" {
      - id                      = "https://reform-scan-prod.vault.azure.net/secrets/blob-router-POSTGRES-USER/b195669792204bea8130f01f5b336cc9" -> null
      - key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/reform-scan-prod/providers/Microsoft.KeyVault/vaults/reform-scan-prod" -> null
      - name                    = "blob-router-POSTGRES-USER" -> null
      - resource_id             = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/reform-scan-prod/providers/Microsoft.KeyVault/vaults/reform-scan-prod/secrets/blob-router-POSTGRES-USER/versions/b195669792204bea8130f01f5b336cc9" -> null
      - resource_versionless_id = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/reform-scan-prod/providers/Microsoft.KeyVault/vaults/reform-scan-prod/secrets/blob-router-POSTGRES-USER" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value) -> null
      - version                 = "b195669792204bea8130f01f5b336cc9" -> null
      - versionless_id          = "https://reform-scan-prod.vault.azure.net/secrets/blob-router-POSTGRES-USER" -> null
    }

  # azurerm_key_vault_secret.POSTGRES_DATABASE will be destroyed
  # (because azurerm_key_vault_secret.POSTGRES_DATABASE is not in configuration)
  - resource "azurerm_key_vault_secret" "POSTGRES_DATABASE" {
      - id                      = "https://reform-scan-prod.vault.azure.net/secrets/blob-router-POSTGRES-DATABASE/f2b81a335fea4e0f8b3014f238e94668" -> null
      - key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/reform-scan-prod/providers/Microsoft.KeyVault/vaults/reform-scan-prod" -> null
      - name                    = "blob-router-POSTGRES-DATABASE" -> null
      - resource_id             = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/reform-scan-prod/providers/Microsoft.KeyVault/vaults/reform-scan-prod/secrets/blob-router-POSTGRES-DATABASE/versions/f2b81a335fea4e0f8b3014f238e94668" -> null
      - resource_versionless_id = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/reform-scan-prod/providers/Microsoft.KeyVault/vaults/reform-scan-prod/secrets/blob-router-POSTGRES-DATABASE" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value) -> null
      - version                 = "f2b81a335fea4e0f8b3014f238e94668" -> null
      - versionless_id          = "https://reform-scan-prod.vault.azure.net/secrets/blob-router-POSTGRES-DATABASE" -> null
    }

  # azurerm_key_vault_secret.POSTGRES_HOST will be destroyed
  # (because azurerm_key_vault_secret.POSTGRES_HOST is not in configuration)
  - resource "azurerm_key_vault_secret" "POSTGRES_HOST" {
      - id                      = "https://reform-scan-prod.vault.azure.net/secrets/blob-router-POSTGRES-HOST/bfc407d1e0484cf2b72572a100c22bc2" -> null
      - key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/reform-scan-prod/providers/Microsoft.KeyVault/vaults/reform-scan-prod" -> null
      - name                    = "blob-router-POSTGRES-HOST" -> null
      - resource_id             = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/reform-scan-prod/providers/Microsoft.KeyVault/vaults/reform-scan-prod/secrets/blob-router-POSTGRES-HOST/versions/bfc407d1e0484cf2b72572a100c22bc2" -> null
      - resource_versionless_id = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/reform-scan-prod/providers/Microsoft.KeyVault/vaults/reform-scan-prod/secrets/blob-router-POSTGRES-HOST" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value) -> null
      - version                 = "bfc407d1e0484cf2b72572a100c22bc2" -> null
      - versionless_id          = "https://reform-scan-prod.vault.azure.net/secrets/blob-router-POSTGRES-HOST" -> null
    }

  # azurerm_key_vault_secret.POSTGRES_PORT will be destroyed
  # (because azurerm_key_vault_secret.POSTGRES_PORT is not in configuration)
  - resource "azurerm_key_vault_secret" "POSTGRES_PORT" {
      - id                      = "https://reform-scan-prod.vault.azure.net/secrets/blob-router-POSTGRES-PORT/4a5c68bea59e4e7fab2cdd74260131d2" -> null
      - key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/reform-scan-prod/providers/Microsoft.KeyVault/vaults/reform-scan-prod" -> null
      - name                    = "blob-router-POSTGRES-PORT" -> null
      - resource_id             = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/reform-scan-prod/providers/Microsoft.KeyVault/vaults/reform-scan-prod/secrets/blob-router-POSTGRES-PORT/versions/4a5c68bea59e4e7fab2cdd74260131d2" -> null
      - resource_versionless_id = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/reform-scan-prod/providers/Microsoft.KeyVault/vaults/reform-scan-prod/secrets/blob-router-POSTGRES-PORT" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value) -> null
      - version                 = "4a5c68bea59e4e7fab2cdd74260131d2" -> null
      - versionless_id          = "https://reform-scan-prod.vault.azure.net/secrets/blob-router-POSTGRES-PORT" -> null
    }

  # azurerm_key_vault_secret.flexible_secret["DATABASE"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret" {
      ~ expiration_date         = "2026-04-03T11:36:23Z" -> (known after apply)
        id                      = "https://reform-scan-prod.vault.azure.net/secrets/blob-router-POSTGRES-FLEXIBLE-DATABASE/aa9b5cb66ff94965b918bc66e709392e"
        name                    = "blob-router-POSTGRES-FLEXIBLE-DATABASE"
        tags                    = {
            "application"         = "bulk-scan-print"
            "builtFrom"           = "https://github.com/HMCTS/blob-router-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#rbs"
            "environment"         = "production"
            "managedBy"           = "Bulk Scanning and Printing"
            "source"              = "blob-router PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret["HOST"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret" {
      ~ expiration_date         = "2026-04-03T11:36:23Z" -> (known after apply)
        id                      = "https://reform-scan-prod.vault.azure.net/secrets/blob-router-POSTGRES-FLEXIBLE-HOST/20a4d51c32b9428a8a26088044abf238"
        name                    = "blob-router-POSTGRES-FLEXIBLE-HOST"
        tags                    = {
            "application"         = "bulk-scan-print"
            "builtFrom"           = "https://github.com/HMCTS/blob-router-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#rbs"
            "environment"         = "production"
            "managedBy"           = "Bulk Scanning and Printing"
            "source"              = "blob-router PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret["PASS"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret" {
      ~ expiration_date         = "2026-04-03T11:36:23Z" -> (known after apply)
        id                      = "https://reform-scan-prod.vault.azure.net/secrets/blob-router-POSTGRES-FLEXIBLE-PASS/8bd193dceb284a2eb8e8a1f66816d03a"
        name                    = "blob-router-POSTGRES-FLEXIBLE-PASS"
        tags                    = {
            "application"         = "bulk-scan-print"
            "builtFrom"           = "https://github.com/HMCTS/blob-router-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#rbs"
            "environment"         = "production"
            "managedBy"           = "Bulk Scanning and Printing"
            "source"              = "blob-router PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret["PORT"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret" {
      ~ expiration_date         = "2026-04-03T11:36:23Z" -> (known after apply)
        id                      = "https://reform-scan-prod.vault.azure.net/secrets/blob-router-POSTGRES-FLEXIBLE-PORT/2326dc6227214314aec01c0ed027d0f2"
        name                    = "blob-router-POSTGRES-FLEXIBLE-PORT"
        tags                    = {
            "application"         = "bulk-scan-print"
            "builtFrom"           = "https://github.com/HMCTS/blob-router-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#rbs"
            "environment"         = "production"
            "managedBy"           = "Bulk Scanning and Printing"
            "source"              = "blob-router PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret["USER"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret" {
      ~ expiration_date         = "2026-04-03T11:36:23Z" -> (known after apply)
        id                      = "https://reform-scan-prod.vault.azure.net/secrets/blob-router-POSTGRES-FLEXIBLE-USER/58355c49bae8455fa71a8208520eb6a6"
        name                    = "blob-router-POSTGRES-FLEXIBLE-USER"
        tags                    = {
            "application"         = "bulk-scan-print"
            "builtFrom"           = "https://github.com/HMCTS/blob-router-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#rbs"
            "environment"         = "production"
            "managedBy"           = "Bulk Scanning and Printing"
            "source"              = "blob-router PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret_standard_format["DATABASE"] will be created
  + resource "azurerm_key_vault_secret" "flexible_secret_standard_format" {
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/reform-scan-prod/providers/Microsoft.KeyVault/vaults/reform-scan-prod"
      + name                    = "blob-router-POSTGRES-DATABASE"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "application"         = "bulk-scan-print"
          + "builtFrom"           = "https://github.com/HMCTS/blob-router-service.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#rbs"
          + "environment"         = "production"
          + "managedBy"           = "Bulk Scanning and Printing"
          + "source"              = "blob-router PostgreSQL"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.flexible_secret_standard_format["HOST"] will be created
  + resource "azurerm_key_vault_secret" "flexible_secret_standard_format" {
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/reform-scan-prod/providers/Microsoft.KeyVault/vaults/reform-scan-prod"
      + name                    = "blob-router-POSTGRES-HOST"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "application"         = "bulk-scan-print"
          + "builtFrom"           = "https://github.com/HMCTS/blob-router-service.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#rbs"
          + "environment"         = "production"
          + "managedBy"           = "Bulk Scanning and Printing"
          + "source"              = "blob-router PostgreSQL"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.flexible_secret_standard_format["PASS"] will be created
  + resource "azurerm_key_vault_secret" "flexible_secret_standard_format" {
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/reform-scan-prod/providers/Microsoft.KeyVault/vaults/reform-scan-prod"
      + name                    = "blob-router-POSTGRES-PASS"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "application"         = "bulk-scan-print"
          + "builtFrom"           = "https://github.com/HMCTS/blob-router-service.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#rbs"
          + "environment"         = "production"
          + "managedBy"           = "Bulk Scanning and Printing"
          + "source"              = "blob-router PostgreSQL"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.flexible_secret_standard_format["PORT"] will be created
  + resource "azurerm_key_vault_secret" "flexible_secret_standard_format" {
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/reform-scan-prod/providers/Microsoft.KeyVault/vaults/reform-scan-prod"
      + name                    = "blob-router-POSTGRES-PORT"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "application"         = "bulk-scan-print"
          + "builtFrom"           = "https://github.com/HMCTS/blob-router-service.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#rbs"
          + "environment"         = "production"
          + "managedBy"           = "Bulk Scanning and Printing"
          + "source"              = "blob-router PostgreSQL"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.flexible_secret_standard_format["USER"] will be created
  + resource "azurerm_key_vault_secret" "flexible_secret_standard_format" {
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/reform-scan-prod/providers/Microsoft.KeyVault/vaults/reform-scan-prod"
      + name                    = "blob-router-POSTGRES-USER"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "application"         = "bulk-scan-print"
          + "builtFrom"           = "https://github.com/HMCTS/blob-router-service.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#rbs"
          + "environment"         = "production"
          + "managedBy"           = "Bulk Scanning and Printing"
          + "source"              = "blob-router PostgreSQL"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.staging_db_host will be destroyed
  # (because azurerm_key_vault_secret.staging_db_host is not in configuration)
  - resource "azurerm_key_vault_secret" "staging_db_host" {
      - id                      = "https://reform-scan-prod.vault.azure.net/secrets/blob-router-staging-db-host/cf2aac22193942b7bf678844a46e0286" -> null
      - key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/reform-scan-prod/providers/Microsoft.KeyVault/vaults/reform-scan-prod" -> null
      - name                    = "blob-router-staging-db-host" -> null
      - resource_id             = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/reform-scan-prod/providers/Microsoft.KeyVault/vaults/reform-scan-prod/secrets/blob-router-staging-db-host/versions/cf2aac22193942b7bf678844a46e0286" -> null
      - resource_versionless_id = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/reform-scan-prod/providers/Microsoft.KeyVault/vaults/reform-scan-prod/secrets/blob-router-staging-db-host" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value) -> null
      - version                 = "cf2aac22193942b7bf678844a46e0286" -> null
      - versionless_id          = "https://reform-scan-prod.vault.azure.net/secrets/blob-router-staging-db-host" -> null
    }

  # azurerm_key_vault_secret.staging_db_name will be destroyed
  # (because azurerm_key_vault_secret.staging_db_name is not in configuration)
  - resource "azurerm_key_vault_secret" "staging_db_name" {
      - id                      = "https://reform-scan-prod.vault.azure.net/secrets/blob-router-staging-db-name/1f5a927c94f54b36a4d50fb72e225833" -> null
      - key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/reform-scan-prod/providers/Microsoft.KeyVault/vaults/reform-scan-prod" -> null
      - name                    = "blob-router-staging-db-name" -> null
      - resource_id             = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/reform-scan-prod/providers/Microsoft.KeyVault/vaults/reform-scan-prod/secrets/blob-router-staging-db-name/versions/1f5a927c94f

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

62a-8d2d-bec7c0b42082" -> null
    }

  # module.reform-blob-router-staging-db.azurerm_resource_group.data-resourcegroup will be destroyed
  # (because azurerm_resource_group.data-resourcegroup is not in configuration)
  - resource "azurerm_resource_group" "data-resourcegroup" {
      - id       = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/blob-router-staging-data-prod" -> null
      - location = "uksouth" -> null
      - name     = "blob-router-staging-data-prod" -> null
      - tags     = {
          - "application"         = "bulk-scan-print"
          - "builtFrom"           = "https://github.com/HMCTS/blob-router-service.git"
          - "businessArea"        = "CFT"
          - "contactSlackChannel" = "#rbs"
          - "environment"         = "production"
          - "managedBy"           = "Bulk Scanning and Printing"
        } -> null
    }

  # module.reform-blob-router-staging-db.azurerm_template_deployment.postgres-paas will be destroyed
  # (because azurerm_template_deployment.postgres-paas is not in configuration)
  - resource "azurerm_template_deployment" "postgres-paas" {
      - deployment_mode     = "Incremental" -> null
      - id                  = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/blob-router-staging-data-prod/providers/Microsoft.Resources/deployments/blob-router-staging-prod" -> null
      - name                = "blob-router-staging-prod" -> null
      - outputs             = {} -> null
      - parameters          = {
          - "administratorLogin"         = "blob_router"
          - "administratorLoginPassword" = "1lIGDV!Dkkhr*XHl"
          - "backupRetentionDays"        = "35"
          - "charset"                    = "utf8"
          - "collation"                  = "en-GB"
          - "commonTags"                 = "eyJhcHBsaWNhdGlvbiI6ImJ1bGstc2Nhbi1wcmludCIsImJ1aWx0RnJvbSI6Imh0dHBzOi8vZ2l0aHViLmNvbS9ITUNUUy9ibG9iLXJvdXRlci1zZXJ2aWNlLmdpdCIsImJ1c2luZXNzQXJlYSI6IkNGVCIsImNvbnRhY3RTbGFja0NoYW5uZWwiOiIjcmJzIiwiZW52aXJvbm1lbnQiOiJwcm9kdWN0aW9uIiwibWFuYWdlZEJ5IjoiQnVsayBTY2FubmluZyBhbmQgUHJpbnRpbmcifQ=="
          - "dbName"                     = "blob_router"
          - "dbRules"                    = "W3sicnVsZV9uYW1lIjoiYXNlIiwic3VibmV0X2lkIjoiL3N1YnNjcmlwdGlvbnMvODk5OWRlYzMtMDEwNC00YTI3LTk0ZWUtNjU4ODU1OTcyOWQxL3Jlc291cmNlR3JvdXBzL2NvcmUtaW5mcmEtcHJvZC9wcm92aWRlcnMvTWljcm9zb2Z0Lk5ldHdvcmsvdmlydHVhbE5ldHdvcmtzL2NvcmUtaW5mcmEtdm5ldC1wcm9kL3N1Ym5ldHMvY29yZS1pbmZyYS1zdWJuZXQtMy1wcm9kIn0seyJydWxlX25hbWUiOiJjZnQtdGYtYWtzMDAiLCJzdWJuZXRfaWQiOiIvc3Vic2NyaXB0aW9ucy84Y2JjNmYzNi03YzU2LTQ5NjMtOWQzNi03MzlkYjVkMDBiMjcvcmVzb3VyY2VHcm91cHMvY2Z0LXByb2QtbmV0d29yay1yZy9wcm92aWRlcnMvTWljcm9zb2Z0Lk5ldHdvcmsvdmlydHVhbE5ldHdvcmtzL2NmdC1wcm9kLXZuZXQvc3VibmV0cy9ha3MtMDAifSx7InJ1bGVfbmFtZSI6ImNmdC10Zi1ha3MwMSIsInN1Ym5ldF9pZCI6Ii9zdWJzY3JpcHRpb25zLzhjYmM2ZjM2LTdjNTYtNDk2My05ZDM2LTczOWRiNWQwMGIyNy9yZXNvdXJjZUdyb3Vwcy9jZnQtcHJvZC1uZXR3b3JrLXJnL3Byb3ZpZGVycy9NaWNyb3NvZnQuTmV0d29yay92aXJ0dWFsTmV0d29ya3MvY2Z0LXByb2Qtdm5ldC9zdWJuZXRzL2Frcy0wMSJ9LHsicnVsZV9uYW1lIjoiamVua2lucy1ha3MiLCJzdWJuZXRfaWQiOiIvc3Vic2NyaXB0aW9ucy8xYmFmNTQ3MC0xYzNlLTQwZDMtYTZmNy03NGJmYmNlNGIzNDgvcmVzb3VyY2VHcm91cHMvY2Z0LXB0bC1uZXR3b3JrLXJnL3Byb3ZpZGVycy9NaWNyb3NvZnQuTmV0d29yay92aXJ0dWFsTmV0d29ya3MvY2Z0LXB0bC12bmV0L3N1Ym5ldHMvaWFhcyJ9LHsicnVsZV9uYW1lIjoiamVua2lucy1ha3MtYWdlbnQiLCJzdWJuZXRfaWQiOiIvc3Vic2NyaXB0aW9ucy8xYmFmNTQ3MC0xYzNlLTQwZDMtYTZmNy03NGJmYmNlNGIzNDgvcmVzb3VyY2VHcm91cHMvY2Z0LXB0bC1uZXR3b3JrLXJnL3Byb3ZpZGVycy9NaWNyb3NvZnQuTmV0d29yay92aXJ0dWFsTmV0d29ya3MvY2Z0LXB0bC12bmV0L3N1Ym5ldHMvYWtzLTAwIn0seyJydWxlX25hbWUiOiJpZGFtLXByb2QyLXZuZXQiLCJzdWJuZXRfaWQiOiIvc3Vic2NyaXB0aW9ucy84OTk5ZGVjMy0wMTA0LTRhMjctOTRlZS02NTg4NTU5NzI5ZDEvcmVzb3VyY2VHcm91cHMvY29yZS1pbmZyYS1pZGFtLXByb2QyL3Byb3ZpZGVycy9NaWNyb3NvZnQuTmV0d29yay92aXJ0dWFsTmV0d29ya3MvY29yZS1pbmZyYS12bmV0LWlkYW0tcHJvZDIvc3VibmV0cy9jb3JlLWluZnJhLXN1Ym5ldC03LWlkYW0tcHJvZDIifSx7InJ1bGVfbmFtZSI6ImJhc3Rpb24tcHJvZC12bmV0Iiwic3VibmV0X2lkIjoiL3N1YnNjcmlwdGlvbnMvMmIxYWZjMTktNWNhOS00Nzk2LWE1NmYtNTc0YTU4NjcwMjQ0L3Jlc291cmNlR3JvdXBzL2Jhc3Rpb24tcHJvZC1yZy9wcm92aWRlcnMvTWljcm9zb2Z0Lk5ldHdvcmsvdmlydHVhbE5ldHdvcmtzL2Jhc3Rpb24tcHJvZC12bmV0L3N1Ym5ldHMvYmFzdGlvbiJ9LHsicnVsZV9uYW1lIjoic2hhcmVkLXNlcnZpY2VzLXByb2QtYWtzMDAiLCJzdWJuZXRfaWQiOiIvc3Vic2NyaXB0aW9ucy81Y2E2MjAyMi02YWEyLTRjZWUtYWFhNy1lNzUzNmM4ZDU2NmMvcmVzb3VyY2VHcm91cHMvc3MtcHJvZC1uZXR3b3JrLXJnL3Byb3ZpZGVycy9NaWNyb3NvZnQuTmV0d29yay92aXJ0dWFsTmV0d29ya3Mvc3MtcHJvZC12bmV0L3N1Ym5ldHMvYWtzLTAwIn0seyJydWxlX25hbWUiOiJzaGFyZWQtc2VydmljZXMtcHJvZC1ha3MwMSIsInN1Ym5ldF9pZCI6Ii9zdWJzY3JpcHRpb25zLzVjYTYyMDIyLTZhYTItNGNlZS1hYWE3LWU3NTM2YzhkNTY2Yy9yZXNvdXJjZUdyb3Vwcy9zcy1wcm9kLW5ldHdvcmstcmcvcHJvdmlkZXJzL01pY3Jvc29mdC5OZXR3b3JrL3ZpcnR1YWxOZXR3b3Jrcy9zcy1wcm9kLXZuZXQvc3VibmV0cy9ha3MtMDEifSx7InJ1bGVfbmFtZSI6InNoYXJlZC1kYXRhLWdhdGV3YXktcHJvZCIsInN1Ym5ldF9pZCI6Ii9zdWJzY3JpcHRpb25zLzA5NzgzMTVjLTc1ZmUtNGFkYS05ZDExLTFlYjVlMGUwYjIxNC9yZXNvdXJjZUdyb3Vwcy9obWN0cy1odWItcHJvZC1pbnQvcHJvdmlkZXJzL01pY3Jvc29mdC5OZXR3b3JrL3ZpcnR1YWxOZXR3b3Jrcy9obWN0cy1odWItcHJvZC1pbnQvc3VibmV0cy9zaGFyZWQtZGF0YS1nYXRld2F5In1d"
          - "env"                        = "prod"
          - "geoRedundantBackup"         = "Enabled"
          - "location"                   = "UK South"
          - "serverName"                 = "blob-router-staging-prod"
          - "skuCapacity"                = "2"
          - "skuName"                    = "GP_Gen5_2"
          - "skuSizeMB"                  = "51200"
          - "skuTier"                    = "GeneralPurpose"
          - "sslEnforcement"             = "Enabled"
          - "version"                    = "11"
        } -> null
      - resource_group_name = "blob-router-staging-data-prod" -> null
      - template_body       = jsonencode(
            {
              - "$schema"      = "http://schema.management.azure.com/schemas/2014-04-01-preview/deploymentTemplate.json#"
              - contentVersion = "1.0.0.0"
              - parameters     = {
                  - administratorLogin         = {
                      - maxLength = 16
                      - minLength = 1
                      - type      = "string"
                    }
                  - administratorLoginPassword = {
                      - type = "securestring"
                    }
                  - backupRetentionDays        = {
                      - defaultValue = 7
                      - type         = "string"
                    }
                  - charset                    = {
                      - type = "string"
                    }
                  - collation                  = {
                      - type = "string"
                    }
                  - commonTags                 = {
                      - type = "string"
                    }
                  - dbName                     = {
                      - type = "string"
                    }
                  - dbRules                    = {
                      - type = "string"
                    }
                  - env                        = {
                      - metadata = {
                          - description = "The tag"
                        }
                      - type     = "string"
                    }
                  - geoRedundantBackup         = {
                      - defaultValue = "Enabled"
                      - type         = "string"
                    }
                  - location                   = {
                      - allowedValues = [
                          - "UK West",
                          - "ukwest",
                          - "UK South",
                          - "uksouth",
                        ]
                      - defaultValue  = "UK South"
                      - type          = "string"
                    }
                  - serverName                 = {
                      - maxLength = 63
                      - minLength = 2
                      - type      = "string"
                    }
                  - skuCapacity                = {
                      - defaultValue = 2
                      - type         = "string"
                    }
                  - skuFamily                  = {
                      - allowedValues = [
                          - "Gen5",
                        ]
                      - defaultValue  = "Gen5"
                      - type          = "string"
                    }
                  - skuName                    = {
                      - allowedValues = [
                          - "B_Gen5_1",
                          - "B_Gen5_2",
                          - "GP_Gen5_2",
                          - "GP_Gen5_4",
                          - "GP_Gen5_8",
                          - "GP_Gen5_16",
                          - "GP_Gen5_32",
                          - "MO_Gen5_2",
                          - "MO_Gen5_4",
                          - "MO_Gen5_8",
                          - "MO_Gen5_16",
                          - "MO_Gen5_32",
                        ]
                      - defaultValue  = "GP_Gen5_2"
                      - type          = "string"
                    }
                  - skuSizeMB                  = {
                      - defaultValue = "51200"
                      - type         = "string"
                    }
                  - skuTier                    = {
                      - allowedValues = [
                          - "Basic",
                          - "GeneralPurpose",
                          - "MemoryOptimized",
                        ]
                      - defaultValue  = "GeneralPurpose"
                      - type          = "string"
                    }
                  - sslEnforcement             = {
                      - defaultValue = "Enabled"
                      - type         = "string"
                    }
                  - version                    = {
                      - allowedValues = [
                          - "9.5",
                          - "9.6",
                          - "10",
                          - "11",
                        ]
                      - defaultValue  = "9.6"
                      - type          = "string"
                    }
                }
              - resources      = [
                  - {
                      - apiVersion = "2017-12-01-preview"
                      - kind       = ""
                      - location   = "[parameters('location')]"
                      - name       = "[parameters('serverName')]"
                      - properties = {
                          - administratorLogin         = "[parameters('administratorLogin')]"
                          - administratorLoginPassword = "[parameters('administratorLoginPassword')]"
                          - sslEnforcement             = "[parameters('sslEnforcement')]"
                          - storageProfile             = {
                              - backupRetentionDays = "[int(parameters('backupRetentionDays'))]"
                              - geoRedundantBackup  = "[parameters('geoRedundantBackup')]"
                              - storageMB           = "[parameters('skuSizeMB')]"
                            }
                          - version                    = "[parameters('version')]"
                        }
                      - resources  = [
                          - {
                              - apiVersion = "2017-12-01-preview"
                              - dependsOn  = [
                                  - "[concat('Microsoft.DBforPostgreSQL/servers/', parameters('serverName'))]",
                                ]
                              - name       = "[parameters('dbName')]"
                              - properties = {
                                  - charset   = "[parameters('charset')]"
                                  - collation = "[parameters('collation')]"
                                }
                              - type       = "databases"
                            },
                        ]
                      - sku        = {
                          - capacity = "[parameters('skuCapacity')]"
                          - family   = "[parameters('skuFamily')]"
                          - name     = "[parameters('skuName')]"
                          - size     = "[parameters('skuSizeMB')]"
                          - tier     = "[parameters('skuTier')]"
                        }
                      - tags       = "[variables('tags')]"
                      - type       = "Microsoft.DBforPostgreSQL/servers"
                    },
                  - {
                      - apiVersion = "2017-12-01-preview"
                      - copy       = {
                          - count = "[length(variables('dbRules'))]"
                          - name  = "storagecopy"
                        }
                      - dependsOn  = [
                          - "[concat('Microsoft.DBforPostgreSQL/servers/', parameters('serverName'))]",
                        ]
                      - location   = "[parameters('location')]"
                      - name       = "[concat(parameters('serverName'), '/', variables('dbRules')[copyIndex()].rule_name)]"
                      - properties = {
                          - ignoreMissingVnetServiceEndpoint = true
                          - virtualNetworkSubnetId           = "[variables('dbRules')[copyIndex()].subnet_id]"
                        }
                      - type       = "Microsoft.DBforPostgreSQL/servers/virtualNetworkRules"
                    },
                ]
              - variables      = {
                  - dbRules = "[base64ToJson(parameters('dbRules'))]"
                  - tags    = "[base64ToJson(parameters('commonTags'))]"
                }
            }
        ) -> null
    }

  # module.reform-blob-router-staging-db.null_resource.subnet_mappings[0] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "3763954441660627138" -> null
      - triggers = {
          - "rule_name" = "ase"
          - "subnet_id" = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/core-infra-prod/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-prod/subnets/core-infra-subnet-3-prod"
        } -> null
    }

  # module.reform-blob-router-staging-db.null_resource.subnet_mappings[1] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "913441541874189194" -> null
      - triggers = {
          - "rule_name" = "cft-tf-aks00"
          - "subnet_id" = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/virtualNetworks/cft-prod-vnet/subnets/aks-00"
        } -> null
    }

  # module.reform-blob-router-staging-db.null_resource.subnet_mappings[2] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "2126687427151201635" -> null
      - triggers = {
          - "rule_name" = "cft-tf-aks01"
          - "subnet_id" = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/virtualNetworks/cft-prod-vnet/subnets/aks-01"
        } -> null
    }

  # module.reform-blob-router-staging-db.null_resource.subnet_mappings[3] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "3006786182575071446" -> null
      - triggers = {
          - "rule_name" = "jenkins-aks"
          - "subnet_id" = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-ptl-network-rg/providers/Microsoft.Network/virtualNetworks/cft-ptl-vnet/subnets/iaas"
        } -> null
    }

  # module.reform-blob-router-staging-db.null_resource.subnet_mappings[4] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "2157878971624278207" -> null
      - triggers = {
          - "rule_name" = "jenkins-aks-agent"
          - "subnet_id" = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-ptl-network-rg/providers/Microsoft.Network/virtualNetworks/cft-ptl-vnet/subnets/aks-00"
        } -> null
    }

  # module.reform-blob-router-staging-db.null_resource.subnet_mappings[5] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "6442714867971450945" -> null
      - triggers = {
          - "rule_name" = "idam-prod2-vnet"
          - "subnet_id" = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/core-infra-idam-prod2/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-idam-prod2/subnets/core-infra-subnet-7-idam-prod2"
        } -> null
    }

  # module.reform-blob-router-staging-db.null_resource.subnet_mappings[6] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "4916196055797924965" -> null
      - triggers = {
          - "rule_name" = "bastion-prod-vnet"
          - "subnet_id" = "/subscriptions/2b1afc19-5ca9-4796-a56f-574a58670244/resourceGroups/bastion-prod-rg/providers/Microsoft.Network/virtualNetworks/bastion-prod-vnet/subnets/bastion"
        } -> null
    }

  # module.reform-blob-router-staging-db.null_resource.subnet_mappings[7] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "8385415197824482476" -> null
      - triggers = {
          - "rule_name" = "shared-services-prod-aks00"
          - "subnet_id" = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/virtualNetworks/ss-prod-vnet/subnets/aks-00"
        } -> null
    }

  # module.reform-blob-router-staging-db.null_resource.subnet_mappings[8] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "2029741671661468273" -> null
      - triggers = {
          - "rule_name" = "shared-services-prod-aks01"
          - "subnet_id" = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/virtualNetworks/ss-prod-vnet/subnets/aks-01"
        } -> null
    }

  # module.reform-blob-router-staging-db.null_resource.subnet_mappings[9] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "2006153177682307355" -> null
      - triggers = {
          - "rule_name" = "shared-data-gateway-prod"
          - "subnet_id" = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/virtualNetworks/hmcts-hub-prod-int/subnets/shared-data-gateway"
        } -> null
    }

  # module.reform-blob-router-staging-db.random_string.password will be destroyed
  # (because random_string.password is not in configuration)
  - resource "random_string" "password" {
      - id          = "1lIGDV!Dkkhr*XHl" -> null
      - length      = 16 -> null
      - lower       = true -> null
      - min_lower   = 0 -> null
      - min_numeric = 0 -> null
      - min_special = 0 -> null
      - min_upper   = 0 -> null
      - number      = true -> null
      - numeric     = true -> null
      - result      = "1lIGDV!Dkkhr*XHl" -> null
      - special     = true -> null
      - upper       = true -> null
    }

Plan: 5 to add, 5 to change, 39 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":2195,"Program":"tfcmt","SHA1":"","Target":"prod","Vars":{}} -->